In [1]:
import numpy as np 
import pandas as pd 
from datetime import datetime
import matplotlib.pyplot as plt

In [2]:
Mainfile = pd.read_csv('Startup Investment Dataset/objects.csv')
print("Total # of rows and columns = ", Mainfile.shape)
Mainfile.head(2)

/Users/mrunalighelani/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3165: DtypeWarning: Columns (3,7,9,10,17,18,21,22,23,25,26,29,30,37) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

Total # of rows and columns =  (462651, 40)

,id,entity_type,entity_id,parent_id,name,normalized_name,permalink,category_code,status,founded_at,...,last_funding_at,funding_rounds,funding_total_usd,first_milestone_at,last_milestone_at,milestones,relationships,created_by,created_at,updated_at
0,c:1,Company,1,NaN,Wetpaint,wetpaint,/company/wetpaint,web,operating,10/17/2005,...,5/19/2008,3,39750000,9/5/2010,9/18/2013,5,17,initial-importer,5/25/2007 6:51,4/13/2013 3:29
1,c:10,Company,10,NaN,Flektor,flektor,/company/flektor,games_video,acquired,NaN,...,NaN,0,0,NaN,NaN,0,6,initial-importer,5/31/2007 21:11,5/23/2008 23:23

In [3]:
Mainfile["entity_type"].value_counts()

Person          226708
Company         196553
Product          27738
FinancialOrg     11652
Name: entity_type, dtype: int64

In [4]:
# Filter startup/company and investor/financial org data for analysis

Mainfile = Mainfile[Mainfile["entity_type"].isin(["Company","FinancialOrg"])]
print("Total # of rows and columns = ", Mainfile.shape)
Mainfile.head(2)

Total # of rows and columns =  (208205, 40)

,id,entity_type,entity_id,parent_id,name,normalized_name,permalink,category_code,status,founded_at,...,last_funding_at,funding_rounds,funding_total_usd,first_milestone_at,last_milestone_at,milestones,relationships,created_by,created_at,updated_at
0,c:1,Company,1,NaN,Wetpaint,wetpaint,/company/wetpaint,web,operating,10/17/2005,...,5/19/2008,3,39750000,9/5/2010,9/18/2013,5,17,initial-importer,5/25/2007 6:51,4/13/2013 3:29
1,c:10,Company,10,NaN,Flektor,flektor,/company/flektor,games_video,acquired,NaN,...,NaN,0,0,NaN,NaN,0,6,initial-importer,5/31/2007 21:11,5/23/2008 23:23

In [5]:
# Remove unnecessary columns

Mainfile.drop(columns=['parent_id','normalized_name','updated_at','created_by',
                       'first_milestone_at','last_milestone_at', 'milestones',
                 'relationships','last_investment_at','last_funding_at',
                 'twitter_username', 'logo_url', 'logo_width', 'logo_height',
                 'description', 'short_description','domain' ,'closed_at','permalink', 
       'tag_list', 'created_at', "first_investment_at", "first_funding_at", "state_code",
       "homepage_url"],inplace=True,errors="ignore")
print("Total # of rows and columns = ", Mainfile.shape)
Mainfile.head(2)

Total # of rows and columns =  (208205, 15)

,id,entity_type,entity_id,name,category_code,status,founded_at,overview,country_code,city,region,investment_rounds,invested_companies,funding_rounds,funding_total_usd
0,c:1,Company,1,Wetpaint,web,operating,10/17/2005,Wetpaint is a technology platform company that...,USA,Seattle,Seattle,0,0,3,39750000
1,c:10,Company,10,Flektor,games_video,acquired,NaN,Flektor is a rich-media mash-up platform that ...,USA,Culver City,Los Angeles,0,0,0,0

In [6]:
Mainfile.to_csv('Startup Investment Dataset/updated_objects.csv', index=False)

In [7]:
# Check for number of empty values (NaN) per column

Mainfile.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 208205 entries, 0 to 208204
Data columns (total 15 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  208205 non-null  object
 1   entity_type         208205 non-null  object
 2   entity_id           208205 non-null  int64
 3   name                208203 non-null  object
 4   category_code       123186 non-null  object
 5   status              208205 non-null  object
 6   founded_at          95832 non-null   object
 7   overview            133896 non-null  object
 8   country_code        95043 non-null   object
 9   city                90684 non-null   object
 10  region              208205 non-null  object
 11  investment_rounds   208205 non-null  int64
 12  invested_companies  208205 non-null  int64
 13  funding_rounds      208205 non-null  int64
 14  funding_total_usd   208205 non-null  int64
dtypes: int64(5), object(10)
memory usage: 25.4+ MB

In [8]:
# Check for % of missing values in each column

(Mainfile.isna().sum()/len(Mainfile) * 100).sort_values(ascending=False).to_frame().rename(columns={0:"% of Missing Data"})

                    % of Missing Data
city                        56.444850
country_code                54.351240
founded_at                  53.972287
category_code               40.834274
overview                    35.690305
name                         0.000961
id                           0.000000
entity_type                  0.000000
entity_id                    0.000000
status                       0.000000
region                       0.000000
investment_rounds            0.000000
invested_companies           0.000000
funding_rounds               0.000000
funding_total_usd            0.000000

In [9]:
# Convert String into Datetime format

Mainfile["founded_at"] = pd.to_datetime(Mainfile["founded_at"])
Mainfile.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 208205 entries, 0 to 208204
Data columns (total 15 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  208205 non-null  object
 1   entity_type         208205 non-null  object
 2   entity_id           208205 non-null  int64
 3   name                208203 non-null  object
 4   category_code       123186 non-null  object
 5   status              208205 non-null  object
 6   founded_at          95832 non-null   datetime64[ns]
 7   overview            133896 non-null  object
 8   country_code        95043 non-null   object
 9   city                90684 non-null   object
 10  region              208205 non-null  object
 11  investment_rounds   208205 non-null  int64
 12  invested_companies  208205 non-null  int64
 13  funding_rounds      208205 non-null  int64
 14  funding_total_usd   208205 non-null  int64
dtypes: datetime64[ns](1), int64(5), object(9)
memory usage: 25.4+ MB

In [10]:
# Separate company and financial org data

company = Mainfile[Mainfile["entity_type"]=="Company"].reset_index(drop=True)
company.drop(columns=["entity_type"], inplace=True)
print(company.shape)
company.head(2)

(196553, 14)

,id,entity_id,name,category_code,status,founded_at,overview,country_code,city,region,investment_rounds,invested_companies,funding_rounds,funding_total_usd
0,c:1,1,Wetpaint,web,operating,2005-10-17,Wetpaint is a technology platform company that...,USA,Seattle,Seattle,0,0,3,39750000
1,c:10,10,Flektor,games_video,acquired,NaT,Flektor is a rich-media mash-up platform that ...,USA,Culver City,Los Angeles,0,0,0,0

In [11]:
company.to_csv('Startup Investment Dataset/updated_objects_company.csv', index=False)

In [12]:
finorg = Mainfile[Mainfile["entity_type"]=="FinancialOrg"].reset_index(drop=True)
finorg.drop(columns=["entity_type"], inplace=True)
print(finorg.shape)
finorg.head(2)

(11652, 14)

,id,entity_id,name,category_code,status,founded_at,overview,country_code,city,region,investment_rounds,invested_companies,funding_rounds,funding_total_usd
0,f:1,1,Greylock Partners,NaN,operating,1965-01-01,Greylock partners with entrepreneurs to help t...,USA,Menlo Park,SF Bay,307,196,0,0
1,f:10,10,Mission Ventures,NaN,operating,1996-01-01,Mission Ventures helps build successful enterp...,USA,San Diego,San Diego,58,33,0,0

In [13]:
finorg.to_csv('Startup Investment Dataset/updated_objects_finorg.csv', index=False)

### Creating Final Company Dataset

In [14]:
# Check % of missing numerical data in company 

company_numrows = len(company)
print("% Missing data for company/startup data for numeric data: ")
print("For funding rounds = ", round(len(company[(company["funding_rounds"]==0)])/company_numrows *100,2), "%")
print("For investment rounds = ", round(len(company[(company["investment_rounds"]==0)])/company_numrows *100,2), "%")
print("For invested companies = ", round(len(company[(company["invested_companies"]==0)])/company_numrows *100,2), "%")
print("For total funding (in USD) = ", round(len(company[(company["funding_total_usd"]==0)])/company_numrows *100,2), "%")

% Missing data for company/startup data for numeric data:
For funding rounds =  83.87 %
For investment rounds =  98.68 %
For invested companies =  98.68 %
For total funding (in USD) =  85.82 %

In [15]:
# Drop ["investment_rounds", "invested_companies"] due to >90% missing data

company.drop(columns=["investment_rounds", "invested_companies"], inplace=True)
print("Total # of rows and columns = ", company.shape)
company.head(2)

Total # of rows and columns =  (196553, 12)

,id,entity_id,name,category_code,status,founded_at,overview,country_code,city,region,funding_rounds,funding_total_usd
0,c:1,1,Wetpaint,web,operating,2005-10-17,Wetpaint is a technology platform company that...,USA,Seattle,Seattle,3,39750000
1,c:10,10,Flektor,games_video,acquired,NaT,Flektor is a rich-media mash-up platform that ...,USA,Culver City,Los Angeles,0,0

In [16]:
company.to_csv("Startup Investment Dataset/updated_Mf_company_2.csv", index=False)

Merge company data with relationships data to get updated company 'founded_at' dates (Fill missing data)

In [17]:
rs = pd.read_csv("Startup Investment Dataset/relationships.csv", usecols=["start_at","relationship_object_id"])
rs.dropna(inplace= True)
rs["start_at"] = pd.to_datetime(rs["start_at"])
print("Total # of rows and columns = ", rs.shape)
rs.head(2)

Total # of rows and columns =  (206995, 2)

  relationship_object_id   start_at
3                    c:3 2006-03-01
4                    c:4 2005-07-01

In [18]:
rs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 206995 entries, 3 to 402873
Data columns (total 2 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   relationship_object_id  206995 non-null  object
 1   start_at                206995 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 4.7+ MB

In [19]:
# Filter company IDs only, and select earliest date from multiple dates for each company (if applicable)

rs = rs[rs["relationship_object_id"].str.startswith("c:")]
print(rs.shape)
rs = rs.groupby(['relationship_object_id']).agg({'start_at': [np.min]})
rs.columns=["start_at"]
rs.head(2)

(193680, 2)

                         start_at
relationship_object_id
c:1                    2005-10-01
c:10                   2006-05-01

In [20]:
company_2 = company.merge(rs, left_on = "id", right_on = "relationship_object_id",how= "left")
company_2.head(2)

,id,entity_id,name,category_code,status,founded_at,overview,country_code,city,region,funding_rounds,funding_total_usd,start_at
0,c:1,1,Wetpaint,web,operating,2005-10-17,Wetpaint is a technology platform company that...,USA,Seattle,Seattle,3,39750000,2005-10-01
1,c:10,10,Flektor,games_video,acquired,NaT,Flektor is a rich-media mash-up platform that ...,USA,Culver City,Los Angeles,0,0,2006-05-01

In [21]:
company_2["Final_Start_at"] = company_2['founded_at'].where(company_2['founded_at'].notnull(),company_2["start_at"])
company_2.isna().sum()/len(company_2) * 100

id                    0.000000
entity_id             0.000000
name                  0.000000
category_code        37.326828
status                0.000000
founded_at           53.586564
overview             35.362981
country_code         55.233448
city                 57.316347
region                0.000000
funding_rounds        0.000000
funding_total_usd     0.000000
start_at             56.540475
Final_Start_at       30.212207
dtype: float64

We see that we have only 30% missing data now in final start date, instead of 53% in founded at dates

In [22]:
company_2.drop(columns=["founded_at", "start_at"], inplace=True)
company_2.rename(columns={"Final_Start_at": "founded_at"}, inplace=True)
company_2.head()

,id,entity_id,name,category_code,status,overview,country_code,city,region,funding_rounds,funding_total_usd,founded_at
0,c:1,1,Wetpaint,web,operating,Wetpaint is a technology platform company that...,USA,Seattle,Seattle,3,39750000,2005-10-17
1,c:10,10,Flektor,games_video,acquired,Flektor is a rich-media mash-up platform that ...,USA,Culver City,Los Angeles,0,0,2006-05-01
2,c:100,100,There,games_video,acquired,There.com is an online virtual world where any...,USA,San Mateo,SF Bay,0,0,1999-01-01
3,c:10000,10000,MYWEBBO,network_hosting,operating,"BRAND NEW ONLINE SOCIAL NETWORKING WEBSITE,FOR...",NaN,NaN,unknown,0,0,2008-07-26
4,c:10001,10001,THE Movie Streamer,games_video,operating,This company shows free movies online on their...,NaN,NaN,unknown,0,0,2008-07-26

In [23]:
# Creating month and year columns

company_2["founded_year"] = company_2.founded_at.dt.year
company_2["founded_month"] = company_2.founded_at.dt.month
company_2['founded_month_year'] = pd.to_datetime(company_2['founded_at']).dt.to_period('M')
company_2.head(2)

,id,entity_id,name,category_code,status,overview,country_code,city,region,funding_rounds,funding_total_usd,founded_at,founded_year,founded_month,founded_month_year
0,c:1,1,Wetpaint,web,operating,Wetpaint is a technology platform company that...,USA,Seattle,Seattle,3,39750000,2005-10-17,2005.0,10.0,2005-10
1,c:10,10,Flektor,games_video,acquired,Flektor is a rich-media mash-up platform that ...,USA,Culver City,Los Angeles,0,0,2006-05-01,2006.0,5.0,2006-05

In [24]:
company_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 196553 entries, 0 to 196552
Data columns (total 15 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  196553 non-null  object
 1   entity_id           196553 non-null  int64
 2   name                196553 non-null  object
 3   category_code       123186 non-null  object
 4   status              196553 non-null  object
 5   overview            127046 non-null  object
 6   country_code        87990 non-null   object
 7   city                83896 non-null   object
 8   region              196553 non-null  object
 9   funding_rounds      196553 non-null  int64
 10  funding_total_usd   196553 non-null  int64
 11  founded_at          137170 non-null  datetime64[ns]
 12  founded_year        137170 non-null  float64
 13  founded_month       137170 non-null  float64
 14  founded_month_year  137170 non-null  period[M]
dtypes: datetime64[ns](1), float64(2), int64(3), object(8), period[M](1)
memory usage: 24.0+ MB

In [25]:
company_2.to_csv("Startup Investment Dataset/updated_Mf_company_3.csv", index=False)

### Cleaning funds and funding rounds datasets

In [26]:
funds = pd.read_csv("Startup Investment Dataset/funds.csv")
funds.head()

,id,fund_id,object_id,name,funded_at,raised_amount,raised_currency_code,source_url,source_description,created_at,updated_at
0,1,1,f:371,Second Fund,12/16/2008,300000000,USD,http://www.pehub.com/26194/dfj-dragon-raising-...,peHub,12/17/2008 3:07,12/17/2008 3:07
1,4,4,f:17,Sequoia Israel Fourth Fund,12/17/2008,200750000,USD,http://www.pehub.com/26725/sequoia-israel-rais...,Sequoia Israel Raises Fourth Fund,12/18/2008 22:04,12/18/2008 22:04
2,5,5,f:951,Tenth fund,8/11/2008,650000000,USD,http://venturebeat.com/2008/08/11/interwest-cl...,Venture Beat,12/31/2008 9:47,12/31/2008 9:47
3,6,6,f:192,New funds acquire,NaN,625000000,USD,http://venturebeat.com/2008/07/28/us-venture-p...,U.S. Venture Partners raises $625M fund for ne...,1/1/2009 18:13,1/1/2009 18:16
4,7,7,f:519,Third fund,5/20/2008,200000000,USD,http://venturebeat.com/2008/05/20/disneys-stea...,Venture Beat,1/3/2009 9:51,9/3/2013 16:34

In [27]:
funds = funds[funds["raised_currency_code"]=='USD']
funds["amt_USD"] = funds["raised_amount"]
print(funds.shape)
funds.head()

(1296, 12)

,id,fund_id,object_id,name,funded_at,raised_amount,raised_currency_code,source_url,source_description,created_at,updated_at,amt_USD
0,1,1,f:371,Second Fund,12/16/2008,300000000,USD,http://www.pehub.com/26194/dfj-dragon-raising-...,peHub,12/17/2008 3:07,12/17/2008 3:07,300000000
1,4,4,f:17,Sequoia Israel Fourth Fund,12/17/2008,200750000,USD,http://www.pehub.com/26725/sequoia-israel-rais...,Sequoia Israel Raises Fourth Fund,12/18/2008 22:04,12/18/2008 22:04,200750000
2,5,5,f:951,Tenth fund,8/11/2008,650000000,USD,http://venturebeat.com/2008/08/11/interwest-cl...,Venture Beat,12/31/2008 9:47,12/31/2008 9:47,650000000
3,6,6,f:192,New funds acquire,NaN,625000000,USD,http://venturebeat.com/2008/07/28/us-venture-p...,U.S. Venture Partners raises $625M fund for ne...,1/1/2009 18:13,1/1/2009 18:16,625000000
4,7,7,f:519,Third fund,5/20/2008,200000000,USD,http://venturebeat.com/2008/05/20/disneys-stea...,Venture Beat,1/3/2009 9:51,9/3/2013 16:34,200000000

In [28]:
funds.drop(columns=["id", "fund_id", "source_url","source_description","created_at","updated_at",
                    "raised_currency_code","raised_amount", "funded_at"],inplace=True)

funds.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1296 entries, 0 to 1563
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   object_id  1296 non-null   object
 1   name       1296 non-null   object
 2   amt_USD    1296 non-null   int64
dtypes: int64(1), object(2)
memory usage: 40.5+ KB

In [29]:
funds.head()

  object_id                        name    amt_USD
0     f:371                 Second Fund  300000000
1      f:17  Sequoia Israel Fourth Fund  200750000
2     f:951                  Tenth fund  650000000
3     f:192           New funds acquire  625000000
4     f:519                  Third fund  200000000

In [30]:
funds.to_csv("Startup Investment Dataset/funds_v2.csv", index=False)

In [31]:
funding_rounds = pd.read_csv("Startup Investment Dataset/funding_rounds.csv")
funding_rounds.head()

,id,funding_round_id,object_id,funded_at,funding_round_type,funding_round_code,raised_amount_usd,raised_amount,raised_currency_code,pre_money_valuation_usd,...,post_money_valuation,post_money_currency_code,participants,is_first_round,is_last_round,source_url,source_description,created_by,created_at,updated_at
0,1,1,c:4,12/1/2006,series-b,b,8500000,8500000,USD,0,...,0,NaN,2,0,0,http://www.marketingvox.com/archives/2006/12/2...,NaN,initial-importer,7/4/2007 4:52,2/27/2008 23:14
1,2,2,c:5,9/1/2004,angel,angel,500000,500000,USD,0,...,0,USD,2,0,1,NaN,NaN,initial-importer,5/27/2007 6:08,6/28/2013 20:07
2,3,3,c:5,5/1/2005,series-a,a,12700000,12700000,USD,115000000,...,0,USD,3,0,0,http://www.techcrunch.com/2007/11/02/jim-breye...,Jim Breyer: Extra $500 Million Round For Faceb...,initial-importer,5/27/2007 6:09,6/28/2013 20:07
3,4,4,c:5,4/1/2006,series-b,b,27500000,27500000,USD,525000000,...,0,USD,4,0,0,http://www.facebook.com/press/info.php?factsheet,Facebook Funding,initial-importer,5/27/2007 6:09,6/28/2013 20:07
4,5,5,c:7299,5/1/2006,series-b,b,10500000,10500000,USD,0,...,0,NaN,2,0,0,http://www.techcrunch.com/2006/05/14/photobuck...,PhotoBucket Closes $10.5M From Trinity Ventures,initial-importer,5/29/2007 11:05,4/16/2008 17:09

In [32]:
funding_rounds.drop(columns=['participants','id','post_money_currency_code','post_money_valuation',
                             'raised_currency_code','raised_amount','pre_money_currency_code','pre_money_valuation',
                             'is_first_round','is_last_round', 'source_url', 'source_description', 'created_by',
                             'pre_money_valuation_usd','post_money_valuation_usd', 'created_at', 'updated_at'], inplace=True)
funding_rounds["funded_at"] = funding_rounds["funded_at"].apply(pd.to_datetime)
print(funding_rounds.shape)
funding_rounds.head()

(52928, 6)

,funding_round_id,object_id,funded_at,funding_round_type,funding_round_code,raised_amount_usd
0,1,c:4,2006-12-01,series-b,b,8500000
1,2,c:5,2004-09-01,angel,angel,500000
2,3,c:5,2005-05-01,series-a,a,12700000
3,4,c:5,2006-04-01,series-b,b,27500000
4,5,c:7299,2006-05-01,series-b,b,10500000

In [33]:
funding_rounds.isna().sum()

funding_round_id        0
object_id               0
funded_at             248
funding_round_type      0
funding_round_code      0
raised_amount_usd       0
dtype: int64

In [34]:
funding_rounds.to_csv("Startup Investment Dataset/funding_rounds_2.csv",index=False)